import { T_Bill } from "./types";

export const BillMocks: T_Bill[] = [
    {
        bill_id: 1,
        name: "5 рублёвая купюра",
        status: 1,
        image: "http://127.0.0.1:9000/rip/5-rub.png",
        year: "1 января 1988 года",
        description: "Банкнота изготовлена на высококачественной хлопковой бумаге светло-зеленого оттенка. В бумагу внедрены фиолетовые, красные и светло-зеленые волокна, а также защитная нить, расположенная вертикально и видимая на просвет. Бумага имеет локальные водяные знаки, размещенные слева и справа на купонных полях. Основное изображение лицевой стороны — памятник «Тысячелетие России» на фоне Софийского собора в Великом Новгороде. Основное изображение оборотной стороны — стена Новгородского кремля."
    },
    {
        bill_id: 2,
        name: "10 рублёвая купюра",
        status: 1,
        image: "http://127.0.0.1:9000/rip/10-rub.png",
        year: "16 августа 2004 года",
        description: "Модифицированная банкнота имеет формат, цветовое и сюжетное оформление, аналогичное банкноте Банка России образца 1997 года. На лицевой стороне модифицированной банкноты, справа от рельефных знаков для людей с ослабленным зрением находится текст «МОДИФИКАЦИЯ 2004 Г.», который расположен вертикально. Банкнота имеет два серийных номера, расположенных на лицевой стороне банкноты и состоящих из двухбуквенного обозначения серии и семи цифр."
    },
    {
        bill_id: 3,
        name: "50 рублёвая купюра",
        status: 1,
        image: "http://127.0.0.1:9000/rip/50-rub.png",
        year: "16 августа 2004 года",
        description: "Модифицированная банкнота имеет формат, цветовое и сюжетное оформление, аналогичное банкноте Банка России образца 1997 года. На лицевой стороне модифицированной банкноты, справа от рельефных знаков для людей с ослабленным зрением находится текст «МОДИФИКАЦИЯ 2004 Г.», который расположен вертикально. Банкнота имеет два серийных номера, расположенных на лицевой стороне банкноты и состоящих из двухбуквенного обозначения серии и семи цифр."
    },
    {
        bill_id: 4,
        name: "",
        status: 1,
        image: "",
        year: "",
        description: ""
    },
    {
        bill_id: 5,
        name: "",
        status: 1,
        image: "",
        year: "",
        description: ""
    },
    {
        bill_id: 6,
        name: "",
        status: 1,
        image: "",
        year: "",
        description: ""
    }
]