import {T_Bill} from "src/modules/types.ts";

export const BillMocks:T_Bill[] = [
    {
        id: 1,
        name: "5 рублевая купюра",
        status: 1,
        image: "",
        description: "Модифицированная банкнота имеет формат и сюжетное оформление, аналогичные банкноте Банка России соответствующего номинала модификации 2004 года. Цветовое и художественное оформление лицевой и оборотной сторон частично изменено. На лицевой стороне модифицированной банкноты, в нижней части левого купонного поля слева от основного изображения, находится текст «МОДИФИКАЦИЯ 2010 ГОДА». Банкнота имеет два серийных номера, расположенных на лицевой стороне банкноты и состоящих из двухбуквенного обозначения серии и семи цифр.",
        year: 100
    },
    {
        id: 2,
        name: "10 рублевая купюра",
        status: 1,
        image: "",
        description: "Преобладающие цвета банкноты — оливковый, оранжевый. Основное изображение лицевой стороны банкноты — фрагмент Спасской башни Московского Кремля с курантами. Основное изображение оборотной стороны банкноты — Ржевский мемориал Советскому Cолдату. На лицевой стороне банкноты слева вверху расположен герб Российской Федерации. На оборотной стороне в верхней правой части банкноты находится надпись «2022» — год выпуска банкноты. В нижней правой части лицевой стороны банкноты расположен QR-код, содержащий ссылку на страницу сайта Банка России с описанием защитных признаков банкноты. Банкнота изготовлена на хлопковой бумаге белого цвета.",
        year: 2004
    },
    {
        id: 3,
        name: "50  рублевая купюра",
        status: 1,
        image: "",
        description: "Модифицированная банкнота имеет формат, цветовое и сюжетное оформление, аналогичное банкноте Банка России образца 1997 года. На лицевой стороне модифицированной банкноты, справа от рельефных знаков для людей с ослабленным зрением находится текст «МОДИФИКАЦИЯ 2004 Г.», который расположен вертикально. Банкнота имеет два серийных номера, расположенных на лицевой стороне банкноты и состоящих из двухбуквенного обозначения серии и семи цифр.",
        year: 2004
    },
    {
        id: 4,
        name: "100  рублевая купюра",
        status: 1,
        image: "",
        description: "Преобладающие цвета банкноты — оливковый, оранжевый. Основное изображение лицевой стороны банкноты — фрагмент Спасской башни Московского Кремля с курантами. Основное изображение оборотной стороны банкноты — Ржевский мемориал Советскому Cолдату. На лицевой стороне банкноты слева вверху расположен герб Российской Федерации. На оборотной стороне в верхней правой части банкноты находится надпись «2022» — год выпуска банкноты. В нижней правой части лицевой стороны банкноты расположен QR-код, содержащий ссылку на страницу сайта Банка России с описанием защитных признаков банкноты. Банкнота изготовлена на хлопковой бумаге белого цвета.",
        year: 2022
    }
]