import { T_Bill } from "./types";

export const BillMocks: T_Bill[] = [
    {
        id: 1,
        name: "5 рублёвая купюра",
        status: 1,
        image: "http://127.0.0.1:9000/rip/5-rub.png",
        year: "1 января 1988 года",
        description: "Банкнота изготовлена на высококачественной хлопковой бумаге светло-зеленого оттенка. В бумагу внедрены фиолетовые, красные и светло-зеленые волокна, а также защитная нить, расположенная вертикально и видимая на просвет. Бумага имеет локальные водяные знаки, размещенные слева и справа на купонных полях. Основное изображение лицевой стороны — памятник «Тысячелетие России» на фоне Софийского собора в Великом Новгороде. Основное изображение оборотной стороны — стена Новгородского кремля."
    },
    {
        id: 2,
        name: "10 рублёвая купюра",
        status: 1,
        image: "http://127.0.0.1:9000/rip/10-rub.png",
        year: "16 августа 2004 года",
        description: "Модифицированная банкнота имеет формат, цветовое и сюжетное оформление, аналогичное банкноте Банка России образца 1997 года. На лицевой стороне модифицированной банкноты, справа от рельефных знаков для людей с ослабленным зрением находится текст «МОДИФИКАЦИЯ 2004 Г.», который расположен вертикально. Банкнота имеет два серийных номера, расположенных на лицевой стороне банкноты и состоящих из двухбуквенного обозначения серии и семи цифр."
    },
    {
        id: 3,
        name: "50 рублёвая купюра",
        status: 1,
        image: "http://127.0.0.1:9000/rip/50-rub.png",
        year: "16 августа 2004 года",
        description: "Модифицированная банкнота имеет формат, цветовое и сюжетное оформление, аналогичное банкноте Банка России образца 1997 года. На лицевой стороне модифицированной банкноты, справа от рельефных знаков для людей с ослабленным зрением находится текст «МОДИФИКАЦИЯ 2004 Г.», который расположен вертикально. Банкнота имеет два серийных номера, расположенных на лицевой стороне банкноты и состоящих из двухбуквенного обозначения серии и семи цифр."
    },
    {
        id: 4,
        name: "100 рублёвая купюра",
        status: 1,
        image: "http://127.0.0.1:9000/rip/100-rub.png",
        year: "30 июня 2022 года",
        description: "Преобладающие цвета банкноты — оливковый, оранжевый. Основное изображение лицевой стороны банкноты — фрагмент Спасской башни Московского Кремля с курантами. Основное изображение оборотной стороны банкноты — Ржевский мемориал Советскому Cолдату. На лицевой стороне банкноты слева вверху расположен герб Российской Федерации. На оборотной стороне в верхней правой части банкноты находится надпись «2022» — год выпуска банкноты. В нижней правой части лицевой стороны банкноты расположен QR-код, содержащий ссылку на страницу сайта Банка России с описанием защитных признаков банкноты. Банкнота изготовлена на хлопковой бумаге белого цвета."
    },
    {
        id: 5,
        name: "500 рублёвая купюра",
        status: 1,
        image: "http://127.0.0.1:9000/rip/500-rub.png",
        year: "6 сентября 2011 года",
        description: "Модифицированная банкнота имеет формат и сюжетное оформление, аналогичные банкноте Банка России соответствующего номинала модификации 2004 года. Цветовое и художественное оформление лицевой и оборотной сторон частично изменено. На лицевой стороне модифицированной банкноты, в нижней части левого купонного поля слева от основного изображения, находится текст «МОДИФИКАЦИЯ 2010 ГОДА». Банкнота имеет два серийных номера, расположенных на лицевой стороне банкноты и состоящих из двухбуквенного обозначения серии и семи цифр."
    },
    {
        id: 6,
        name: "1000 рублёвая купюра",
        status: 1,
        image: "http://127.0.0.1:9000/rip/1000-rub.png",
        year: "10 августа 2010 года",
        description: "Модифицированная банкнота имеет формат и сюжетное оформление, аналогичные банкноте Банка России соответствующего номинала модификации 2004 года. Цветовое оформление банкноты претерпело незначительное изменение. На лицевой стороне модифицированной банкноты, в нижней части широкого купонного поля справа от основного изображения, находится текст «МОДИФИКАЦИЯ 2010 ГОДА». Банкнота имеет два серийных номера, расположенных на лицевой стороне банкноты и состоящих из двухбуквенного обозначения серии и семи цифр."
    }
]